InformationRegisters/РасширенныйЛог.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РасширенныйЛог</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФункцияИсточник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийПолный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛогОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛогОшибок</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФункцияИсточник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийПолный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ASK_ОбработкаОшибок/Ext/Module.bsl
//Результат = "#Ошибка при получении товара по серийному номеру: " + СерийныеНомер + ". Ошибка: " + ОписаниеОшибки();
//Ошибка("#Ошибка выполнения операции",Результат,"ПолучитьТоварПоСерийномуНомеру");

&НаСервере
Процедура Ошибка( Ошибка, ОписаниеОшибки, сФункция = "") Экспорт
	
	ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки,"{","""");                    
	ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки,"}","""");	
	
	Событие = "Ошибка";
	ЗаписатьИнформациюВЛогОшибок(Ошибка, ОписаниеОшибки, сФункция, Событие);
	// ЗаписатьИнформациюВЛогОшибок(Ошибка,ОписаниеОшибки,сФункция,"Ошибка");	
	
	#Если НЕ МобильноеПриложениеСервер Тогда
		ЗаписьЖурналаРегистрации("АРМ Кладовщика", УровеньЖурналаРегистрации.Ошибка, ,"", ОписаниеОшибки);	
	#КонецЕсли
				
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИнформациюВЛогОшибок(Ошибка, ОписаниеОшибки, сФункция = "", Событие = "") Экспорт
	
	//+Шульман А. 05.12.2025 #UT10-5576   
	//ЗаписьРегистра = РегистрыСведений.ЛогОшибок.СоздатьМенеджерЗаписи();
	//ЗаписьРегистра.Период           = ТекущаяДата();   
	ДатаЗаписи  = ТекущаяДата();  
	НомерЗаписи = ТекущаяУниверсальнаяДатаВМиллисекундах();     
	
	ЗаписьРегистра = РегистрыСведений.РасширенныйЛог.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.ДатаЗаписи  = ДатаЗаписи;  
	ЗаписьРегистра.НомерЗаписи = НомерЗаписи;     
	ЗаписьРегистра.Прочитать();
	
	Пока ЗаписьРегистра.Выбран() Цикл
		
		НомерЗаписи = ТекущаяУниверсальнаяДатаВМиллисекундах();     
		ЗаписьРегистра.НомерЗаписи = НомерЗаписи;     
		ЗаписьРегистра.Прочитать();
		
	КонецЦикла;                         
	
	ЗаписьРегистра.ДатаЗаписи  = ДатаЗаписи;  
	ЗаписьРегистра.НомерЗаписи = НомерЗаписи;     
	//-Шульман А. 05.12.2025 #UT10-5576  
	
	ЗаписьРегистра.Событие           = Событие;
	ЗаписьРегистра.Комментарий       = ?(ПустаяСтрока(Ошибка), "", Строка(Ошибка) + " - ") + ?(ПустаяСтрока(ОписаниеОшибки), "", ОписаниеОшибки);      
	ЗаписьРегистра.КомментарийПолный = "";
	
	ЗаписьРегистра.ФункцияИсточник  = сФункция;
	
	ЗаписьРегистра.Записать();
	
КонецПроцедуры
 
&НаСервере
Процедура ОчиститьЛогиПрограммы() Экспорт
	
	//+Шульман А. 05.12.2025 #UT10-5576
	НаборЗаписей = РегистрыСведений.ЛогОшибок.СоздатьНаборЗаписей();  
	НаборЗаписей.Записать();
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.РасширенныйЛог КАК ЛогОшибок
	|ГДЕ                           
	|	ЛогОшибок.ДатаЗаписи <= &Период";
	
	Запрос.УстановитьПараметр("Период", КонецДня( ТекущаяДата() - 14*24*60*60) );
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.РасширенныйЛог.СоздатьНаборЗаписей();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Отбор, РезультатЗапроса);
		НаборЗаписей.Записать();
		
	КонецЦикла; 
	//-Шульман А. 05.12.2025 #UT10-5576
	 
КонецПроцедуры                                                  

Процедура ПолучитьСтекВызовов(Источник, Событие = "", ЗаписатьВЛог = Ложь) Экспорт

	//+Шульман А. 05.12.2025 #UT10-5576  
	Попытка
		ВызватьИсключение 1;
	Исключение
		СтекВызовов = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;                
	
	Если ЗаписатьВЛог Тогда
		
		Счетчик = Константы.СчетчикДействий.Получить();    
		Константы.СчетчикДействий.Установить(Счетчик+1);
		
		ЗаписьРегистра = РегистрыСведений.РасширенныйЛог.СоздатьМенеджерЗаписи();
		
		НомерЗаписи      = ТекущаяУниверсальнаяДатаВМиллисекундах(); 
		ДатаЗаписи       = ТекущаяДата();
		ЗаписьРегистра.ДатаЗаписи       = ДатаЗаписи;  
		ЗаписьРегистра.НомерЗаписи      = НомерЗаписи;     
		ЗаписьРегистра.Прочитать();
		
		Пока ЗаписьРегистра.Выбран() Цикл
			
			НомерЗаписи  = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьРегистра.НомерЗаписи  = НомерЗаписи;     
			ЗаписьРегистра.Прочитать();
			
		КонецЦикла;
		
		ЗаписьРегистра.ДатаЗаписи       = ДатаЗаписи;  
		ЗаписьРегистра.НомерЗаписи      = НомерЗаписи;     
		ЗаписьРегистра.Событие          = "Тест, шаг " + Строка(Счетчик) + ". " + Событие;
		ЗаписьРегистра.Комментарий      = СтекВызовов;  
		ЗаписьРегистра.КомментарийПолный = СтекВызовов;
		ЗаписьРегистра.ФункцияИсточник  = Источник;
		
		ЗаписьРегистра.Записать();     
		
	КонецЕсли;
	//-Шульман А. 05.12.2025 #UT10-5576

КонецПроцедуры
